Repository: growdigital/ysgoltrewen
Catalog: lang/*.po
Languages: cy

source: That page can’t be found.
cy: Ni ellir ddod o hyd i’r dudalen yna.

source: It looks like nothing was found at this location. Maybe try one of the links below or a search?
cy: Ni ellir ddod o hyd i unrhywbeth yn y lleoliad hwn. Cliciwch ar un o’r liciau isod neu chwiliwch.

source: Address
cy: Cyfeiriad

source: Newcastle Emlyn
cy: Castell Newydd Emlyn

source: Tel
cy: Rhif ffôn

source: Email
cy: Ebost

source: School details
cy: Manylion ysgol

source: Telephone
cy: Rhif ffôn

source: Headteacher
cy: Pennaeth

source: Language
cy: Iaith

source: Age range
cy: Ystod oedran

source: Number of pupils
cy: Nifer y disgyblion

source: Ysgol Trewen logo
cy: logo Ysgol Trewen

source: Term dates
cy: Dyddiadau’r tymor

source: Half term
cy: Hanner tymor

source: Inset days
cy: Diwrnodau Hyfforddiant mewn Swydd (HMS)

source: Directed teachers’ closure days
cy: Diwrnodau gosod i athrawon

source: Photograph of
cy: Llun o

source: Search results for
cy: Canlyniadau chwilio am
